I tried to change all those resources name to fit-in `v0.3.2`, then do `terraform state rm` and `terraform import`, the imported `netskope_npa_private_app` resources seems missing `app_name` property, and further `terraform plan` will cause the resource be recreated: 
```
Terraform will perform the following actions:

  # netskope_npa_private_app.this must be replaced
-/+ resource "netskope_npa_private_app" "this" {
      ~ allow_unauthenticated_cors    = false -> (known after apply)
      + allow_uri_bypass              = (known after apply)
      + app_name                      = "xxx" # forces replacement
      ~ app_option                    = {} -> (known after apply)
```
